# ── CLI Tools ───────────────────────────────────────────────────────
brew "coreutils"                      # GNU core utilities
brew "git"                             # Version control
brew "git-delta"                       # Syntax-highlighting diff pager
brew "gh"                              # GitHub CLI
brew "vim"                             # Terminal editor
brew "jq"                              # JSON processor
brew "ripgrep"                         # Fast recursive grep (rg)
brew "tree"                            # Directory tree viewer
brew "wget"                            # File downloader
brew "rsync"                           # File sync/transfer
brew "rename"                          # Batch file renaming
brew "trash"                           # Safe rm → Trash
brew "ncdu"                            # Interactive disk usage
brew "hyperfine"                       # Command benchmarking
brew "exiftool"                        # Image/video metadata
brew "imagemagick"                     # Image manipulation
brew "ffmpeg"                          # Audio/video processing
brew "stow"                            # Symlink manager (dotfiles)

# Shell & prompt
brew "fzf"                             # Fuzzy finder (Ctrl-R, Ctrl-T, Alt-C)
brew "sheldon"                         # Zsh plugin manager
brew "starship"                        # Cross-shell prompt
brew "zoxide"                          # Smart directory jumper (z)
brew "eza"                             # Modern ls with icons + git

# Dev tools
brew "volta"                           # Node.js version manager
brew "rust"                            # Rust toolchain
brew "python@3.14"                     # Python 3.14
brew "openjdk@11"                      # Java 11
brew "cmake"                           # Build system generator

# DevOps
brew "helm"                            # Kubernetes package manager
brew "argocd"                          # ArgoCD GitOps CLI
brew "act"                             # Run GitHub Actions locally

# AI
brew "ollama"                          # Run LLMs locally

# Misc
brew "blueutil"                        # Bluetooth CLI control
brew "scrcpy"                          # Android screen mirroring
brew "nmap"                            # Network scanner

# ── GUI Apps ────────────────────────────────────────────────────────
cask "appcleaner"
cask "cleanshot"
cask "deepl"
cask "firefox"
cask "gcloud-cli"
cask "google-chrome"
cask "handbrake-app"
cask "istat-menus"
cask "maccy"
cask "monitorcontrol"
cask "mullvad-vpn"
cask "numi"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "tailscale-app"
cask "telegram-desktop"
cask "the-unarchiver"
cask "tuple"
cask "twist"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
