jethrokuan/z
edc/bass
laughedelic/pisces
oh-my-fish/plugin-bang-bang
oh-my-fish/plugin-ssh
fishpkg/fish-humanize-duration
decors/fish-colors
IlanCosman/tide
oh-my-fish/plugin-node-binpath
