jethrokuan/z
edc/bass
laughedelic/pisces
oh-my-fish/plugin-bang-bang
oh-my-fish/plugin-ssh
oh-my-fish/plugin-node-binpath
oh-my-fish/plugin-expand
fishpkg/fish-pwd-info
fishpkg/fish-humanize-duration
fishpkg/fish-pwd-is-home
fishpkg/fish-last-job-id
fishpkg/fish-host-info
decors/fish-colors
jorgebucaran/fish-nvm
james2doyle/omf-plugin-fnm
