oh-my-fish/plugin-argu
fisherman/autojump
nyarly/fish-bang-bang
edc/bass
oh-my-fish/plugin-brew
oh-my-fish/plugin-foreign-env
fisherman/host_info
fisherman/humanize_duration
fisherman/last_job_id
derekstavis/plugin-nvm
oh-my-fish/plugin-osx
fisherman/pwd_info
fisherman/pwd_is_home
oh-my-fish/plugin-ssh
oh-my-fish/plugin-thefuck
