jethrokuan/z
edc/bass
laughedelic/pisces
oh-my-fish/plugin-bang-bang
oh-my-fish/plugin-ssh
oh-my-fish/plugin-node-binpath
oh-my-fish/plugin-expand
decors/fish-colors
jorgebucaran/fish-nvm
james2doyle/omf-plugin-fnm
IlanCosman/tide
